TomCrypto/lpc11xx/svd/LPC11xx-v6-z0.xml
        <register>
          <name>MCR</name>
          <description>Modem control register</description>
          <addressOffset>0x010</addressOffset>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DTRC</name>
              <description>DTR Control. Source for modem output pin, DTR. This bit reads as 0 when modem loopback mode is active</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RTSC</name>
              <description>RTS Control. Source for modem output pin RTS. This bit reads as 0 when modem loopback mode is active</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>LMS</name>
              <description>Loopback Mode Select. The modem loopback mode provides a mechanism to perform diagnostic loopback testing. Serial data from the transmitter is connected internally to serial input of the receiver. Input pin, RXD, has no effect on loopback and output pin, TXD is held in marking state. The four modem inputs (CTS, DSR, RI and DCD) are disconnected externally. Externally, the modem outputs (RTS, DTR) are set inactive. Internally, the four modem outputs are connected to the four modem inputs. As a result of these connections, the upper four bits of the MSR will be driven by the lower four bits of the MCR rather than the four modem inputs in normal mode. This permits modem status interrupts to be generated in loopback mode by writing the lower four bits of MCR</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RTSEN</name>
              <description>RTS flow control</description>
              <bitRange>[6:6]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE_AUTO_RTS_FLO</name>
                  <description>Disable auto-rts flow control</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_AUTO_RTS_FLOW</name>
                  <description>Enable auto-rts flow control</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTSEN</name>
              <description>CTS flow control</description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE_AUTO_CTS_FLO</name>
                  <description>Disable auto-cts flow control</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_AUTO_CTS_FLOW</name>
                  <description>Enable auto-cts flow control</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LSR</name>
          <description>Line Status Register. Contains flags for transmit and receive status, including line errors</description>
          <addressOffset>0x014</addressOffset>
          <access>read-only</access>
          <resetValue>0x60</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RDR</name>
              <description>Receiver Data Ready. LSR[0] is set when the RBR holds an unread character and is cleared when the UART RBR FIFO is empty</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>EMPTY_</name>
                  <description>RBR is empty</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>RBR contains valid data</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OE</name>
              <description>Overrun Error. The overrun error condition is set as soon as it occurs. A LSR read clears LSR[1]. LSR[1] is set when UART RSR has a new character assembled and the UART RBR FIFO is full. In this case, the UART RBR FIFO will not be overwritten and the character in the UART RSR will be lost</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Overrun error status is inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Overrun error status is active</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PE</name>
              <description>Parity Error. When the parity bit of a received character is in the wrong state, a parity error occurs. A LSR read clears LSR[2]. Time of parity error detection is dependent on FCR[0]. Note: A parity error is associated with the character at the top of the UART RBR FIFO</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Parity error status is inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Parity error status is active</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FE</name>
              <description>Framing Error. When the stop bit of a received character is a logic 0, a framing error occurs. A LSR read clears LSR[3]. The time of the framing error detection is dependent on FCR0. Upon detection of a framing error, the RX will attempt to re-synchronize to the data and assume that the bad stop bit is actually an early start bit. However, it cannot be assumed that the next received byte will be correct even if there is no Framing Error. Note: A framing error is associated with the character at the top of the UART RBR FIFO</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Framing error status is inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Framing error status is active</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BI</name>
              <description>Break Interrupt. When RXD1 is held in the spacing state (all zeros) for one full character transmission (start, data, parity, stop), a break interrupt occurs. Once the break condition has been detected, the receiver goes idle until RXD1 goes to marking state (all ones). A LSR read clears this status bit. The time of break detection is dependent on FCR[0]. Note: The break interrupt is associated with the character at the top of the UART RBR FIFO</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Break interrupt status is inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Break interrupt status is active</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>THRE</name>
              <description>Transmitter Holding Register Empty. THRE is set immediately upon detection of an empty UART THR and is cleared on a THR write</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>THR contains valid data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMPTY_</name>
                  <description>THR is empty</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEMT</name>
              <description>Transmitter Empty. TEMT is set when both THR and TSR are empty; TEMT is cleared when either the TSR or the THR contain valid data</description>
              <bitRange>[6:6]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>THR and/or the TSR contains valid data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMPTY_</name>
                  <description>THR and the TSR are empty</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXFE</name>
              <description>Error in RX FIFO. LSR[7] is set when a character with a RX error such as framing error, parity error or break interrupt, is loaded into the RBR. This bit is cleared when the LSR register is read and there are no subsequent errors in the UART FIFO</description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>NOERROR</name>
                  <description>RBR contains no UART RX errors or FCR[0]=0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR</name>
                  <description>UART RBR contains at least one UART RX error</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MSR</name>
          <description>Modem status register</description>
          <addressOffset>0x018</addressOffset>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCTS</name>
              <description>Delta CTS. Set upon state change of input CTS. Cleared on a MSR read</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>NO_CHANGE_DETECTED_O</name>
                  <description>No change detected on modem input CTS</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATE_CHANGE_DETECTE</name>
                  <description>State change detected on modem input CTS</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DDSR</name>
              <description>Delta DSR. Set upon state change of input DSR. Cleared on a MSR read</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>NO_CHANGE_DETECTED_O</name>
                  <description>No change detected on modem input DSR</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATE_CHANGE_DETECTE</name>
                  <description>State change detected on modem input DSR</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TERI</name>
              <description>Trailing Edge RI. Set upon low to high transition of input RI. Cleared on a MSR read</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>NO_CHANGE_DETECTED_O</name>
                  <description>No change detected on modem input, RI</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW_TO_HIGH_TRANSITI</name>
                  <description>Low-to-high transition detected on RI</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DDCD</name>
              <description>Delta DCD. Set upon state change of input DCD. Cleared on a MSR read</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>NO_CHANGE_DETECTED_O</name>
                  <description>No change detected on modem input DCD</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATE_CHANGE_DETECTE</name>
                  <description>State change detected on modem input DCD</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTS</name>
              <description>Clear To Send State. Complement of input signal CTS. This bit is connected to MCR[1] in modem loopback mode</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DSR</name>
              <description>Data Set Ready State. Complement of input signal DSR. This bit is connected to MCR[0] in modem loopback mode</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RI</name>
              <description>Ring Indicator State. Complement of input RI. This bit is connected to MCR[2] in modem loopback mode</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DCD</name>
              <description>Data Carrier Detect State. Complement of input DCD. This bit is connected to MCR[3] in modem loopback mode</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCR</name>
          <description>Scratch Pad Register. Eight-bit temporary storage for software</description>
          <addressOffset>0x01C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pad</name>
              <description>A readable, writable byte</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACR</name>
          <description>Auto-baud Control Register. Contains controls for the auto-baud feature</description>
          <addressOffset>0x020</addressOffset>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>START</name>
              <description>Start bit. This bit is automatically cleared after auto-baud completion</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Auto-baud stop (auto-baud is not running)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START</name>
                  <description>Auto-baud start (auto-baud is running). Auto-baud run bit. This bit is automatically cleared after auto-baud completion</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Auto-baud mode select</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>MODE_0_</name>
                  <description>Mode 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE_1_</name>
                  <description>Mode 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUTORESTART</name>
              <description>Restart enable</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>NO_RESTART</name>
                  <description>No restart</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESTART_IN_CASE_OF_T</name>
                  <description>Restart in case of time-out (counter restarts at next UART Rx falling edge)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined</description>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>ABEOINTCLR</name>
              <description>End of auto-baud interrupt clear (write only accessible)</description>
              <bitRange>[8:8]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>NOIMPACT</name>
                  <description>Writing a 0 has no impact</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Writing a 1 will clear the corresponding interrupt in the IIR</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ABTOINTCLR</name>
              <description>Auto-baud time-out interrupt clear (write only accessible)</description>
              <bitRange>[9:9]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>NOIMPACT</name>
                  <description>Writing a 0 has no impact</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Writing a 1 will clear the corresponding interrupt in the IIR</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined</description>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FDR</name>
          <description>Fractional Divider Register. Generates a clock input for the baud rate divider</description>
          <addressOffset>0x028</addressOffset>
          <access>read-write</access>
          <resetValue>0x10</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIVADDVAL</name>
              <description>Baud rate generation pre-scaler divisor value. If this field is 0, fractional baud rate generator will not impact the UART baud rate</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>MULVAL</name>
              <description>Baud rate pre-scaler multiplier value. This field must be greater or equal 1 for UART to operate properly, regardless of whether the fractional baud rate generator is used or not</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined</description>
              <bitRange>[31:8]</bitRange>
            </field>
          </fields>
        </register>
