TomCrypto/lpc11xx/svd/LPC11xx-v6-z0.xml
        <register>
          <name>TER</name>
          <description>Transmit Enable Register. Turns off UART transmitter for use with software flow control</description>
          <addressOffset>0x030</addressOffset>
          <access>read-write</access>
          <resetValue>0x80</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>TXEN</name>
              <description>When this bit is 1, as it is after a Reset, data written to the THR is output on the TXD pin as soon as any preceding data has been sent. If this bit cleared to 0 while a character is being sent, the transmission of that character is completed, but no further characters are sent until this bit is set again. In other words, a 0 in this bit blocks the transfer of characters from the THR or TX FIFO into the transmit shift register. Software can clear this bit when it detects that the a hardware-handshaking TX-permit signal (CTS) has gone false, or with software handshaking, when it receives an XOFF character (DC3). Software can set this bit again when it detects that the TX-permit signal has gone true, or when it receives an XON (DC1) character</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RS485CTRL</name>
          <description>RS-485/EIA-485 Control. Contains controls to configure various aspects of RS-485/EIA-485 modes</description>
          <addressOffset>0x04C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NMMEN</name>
              <description>NMM enable</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>RS-485/EIA-485 Normal Multidrop Mode (NMM) is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>RS-485/EIA-485 Normal Multidrop Mode (NMM) is enabled. In this mode, an address is detected when a received byte causes the UART to set the parity error and generate an interrupt</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXDIS</name>
              <description>Receiver enable</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The receiver is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>The receiver is disabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AADEN</name>
              <description>AAD enable</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Auto Address Detect (AAD) is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Auto Address Detect (AAD) is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL</name>
              <description>Select direction control pin</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>RTS</name>
                  <description>If direction control is enabled (bit DCTRL = 1), pin RTS is used for direction control</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTR</name>
                  <description>If direction control is enabled (bit DCTRL = 1), pin DTR is used for direction control</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCTRL</name>
              <description>Auto direction control enable</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE_AUTO_DIRECTI</name>
                  <description>Disable Auto Direction Control</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_AUTO_DIRECTIO</name>
                  <description>Enable Auto Direction Control</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OINV</name>
              <description>Polarity control. This bit reverses the polarity of the direction control signal on the RTS (or DTR) pin</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>The direction control pin will be driven to logic 0 when the transmitter has data to be sent. It will be driven to logic 1 after the last bit of data has been transmitted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>The direction control pin will be driven to logic 1 when the transmitter has data to be sent. It will be driven to logic 0 after the last bit of data has been transmitted</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined</description>
              <bitRange>[31:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RS485ADRMATCH</name>
          <description>RS-485/EIA-485 address match. Contains the address match value for RS-485/EIA-485 mode</description>
          <addressOffset>0x050</addressOffset>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADRMATCH</name>
              <description>Contains the address match value</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RS485DLY</name>
          <description>RS-485/EIA-485 direction control delay</description>
          <addressOffset>0x054</addressOffset>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DLY</name>
              <description>Contains the direction control (RTS or DTR) delay value. This register works in conjunction with an 8-bit counter</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined</description>
              <bitRange>[31:8]</bitRange>
            </field>
          </fields>
        </register>
