TomCrypto/lpc11xx/svd/LPC11xx-v6-z0.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>IOCON</name>
      <description>I/O Configuration Block</description>
      <groupName>IOCON</groupName>
      <baseAddress>0x40044000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xFFF</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IOCON_PIO2_6</name>
          <description>I/O configuration for pin PIO2_6/ CT32B0_MAT1</description>
          <addressOffset>0x000</addressOffset>
          <access>read-write</access>
          <resetValue>0xD0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FUNC</name>
              <description>Configure pin function</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>PIO2_6</name>
                  <description>Pin function PIO2_6</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32B0_MAT1</name>
                  <description>Pin function CT32B0_MAT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Pin function mode (on-chip pull-up/pull-down resistor control)</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor enabled)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYSTERESIS</name>
              <description>Hysteresis</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[9:6]</bitRange>
            </field>
            <field>
              <name>OPEN_DRAIN</name>
              <description>Selects pseudo open-drain mode</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>GPIO_OUTPUT</name>
                  <description>Standard GPIO output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_DRAIN_OUTPUT</name>
                  <description>Open-drain output</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON_PIO2_0</name>
          <description>I/O configuration for pin PIO2_0/DTR/SSEL1</description>
          <addressOffset>0x008</addressOffset>
          <access>read-write</access>
          <resetValue>0xD0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FUNC</name>
              <description>Configure pin function</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>PIO2_0</name>
                  <description>Pin function PIO2_0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTR</name>
                  <description>Pin function DTR</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSEL1</name>
                  <description>Pin function SSEL1</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Pin function mode (on-chip pull-up/pull-down resistor control)</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor enabled)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYSTERESIS</name>
              <description>Hysteresis</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[9:6]</bitRange>
            </field>
            <field>
              <name>OPEN_DRAIN</name>
              <description>Selects pseudo open-drain mode</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>GPIO_OUTPUT</name>
                  <description>Standard GPIO output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_DRAIN_OUTPUT</name>
                  <description>Open-drain output</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON_RESET_PIO0_0</name>
          <description>I/O configuration for pin RESET/PIO0_0</description>
          <addressOffset>0x00C</addressOffset>
          <access>read-write</access>
          <resetValue>0xD0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FUNC</name>
              <description>Configure pin function</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Pin function RESET</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIO0_0</name>
                  <description>Pin function PIO0_0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Pin function mode (on-chip pull-up/pull-down resistor control)</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor enabled)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYSTERESIS</name>
              <description>Hysteresis</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[9:6]</bitRange>
            </field>
            <field>
              <name>OPEN_DRAIN</name>
              <description>Selects pseudo open-drain mode</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>GPIO_OUTPUT</name>
                  <description>Standard GPIO output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_DRAIN_OUTPUT</name>
                  <description>Open-drain output</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON_PIO0_1</name>
          <description>I/O configuration for pin PIO0_1/CLKOUT/CT32B0_MAT2</description>
          <addressOffset>0x010</addressOffset>
          <access>read-write</access>
          <resetValue>0xD0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FUNC</name>
              <description>Configure pin function</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>PIO0_1</name>
                  <description>Pin function PIO0_1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUT</name>
                  <description>Pin function CLKOUT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32B0_MAT2</name>
                  <description>Pin function CT32B0_MAT2</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Pin function mode (on-chip pull-up/pull-down resistor control)</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor enabled)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYSTERESIS</name>
              <description>Hysteresis</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[9:6]</bitRange>
            </field>
            <field>
              <name>OPEN_DRAIN</name>
              <description>Selects pseudo open-drain mode</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>GPIO_OUTPUT</name>
                  <description>Standard GPIO output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_DRAIN_OUTPUT</name>
                  <description>Open-drain output</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON_PIO1_8</name>
          <description>I/O configuration for pin PIO1_8/CT16B1_CAP0</description>
          <addressOffset>0x014</addressOffset>
          <access>read-write</access>
          <resetValue>0xD0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FUNC</name>
              <description>Configure pin function</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>PIO1_8</name>
                  <description>Pin function PIO1_8</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT16B1_CAP0</name>
                  <description>Pin function CT16B1_CAP0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Pin function mode (on-chip pull-up/pull-down resistor control)</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor enabled)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYSTERESIS</name>
              <description>Hysteresis</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[9:6]</bitRange>
            </field>
            <field>
              <name>OPEN_DRAIN</name>
              <description>Selects pseudo open-drain mode</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>GPIO_OUTPUT</name>
                  <description>Standard GPIO output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_DRAIN_OUTPUT</name>
                  <description>Open-drain output</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:11]</bitRange>
            </field>
          </fields>
        </register>
