TomCrypto/lpc11xx/svd/LPC11xx-v6-z0.xml
        <register>
          <name>IOCON_PIO0_5</name>
          <description>I/O configuration for pin PIO0_5/SDA</description>
          <addressOffset>0x034</addressOffset>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FUNC</name>
              <description>Configure pin function</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>PIO0_5</name>
                  <description>Pin function PIO0_5 (open-drain pin)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C</name>
                  <description>Pin function SDA (open-drain pin)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2CMODE</name>
              <description>Selects I2C mode. Select Standard mode (I2CMODE = 00, default) or Standard I/O functionality (I2CMODE = 01) if the pin function is GPIO (FUNC = 000)</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>STANDARD_MODE_FAST</name>
                  <description>Standard mode/ Fast-mode I2C</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STANDARD_IO_FUNCTION</name>
                  <description>Standard I/O functionality</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAST_MODE_PLUS_I2C</name>
                  <description>Fast-mode Plus I2C</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON_PIO1_9</name>
          <description>I/O configuration for pin PIO1_9/CT16B1_MAT0/ MOSI1</description>
          <addressOffset>0x038</addressOffset>
          <access>read-write</access>
          <resetValue>0xD0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FUNC</name>
              <description>Configure pin function</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>PIO1_9</name>
                  <description>Pin function PIO1_9</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT16B1_MAT0</name>
                  <description>Pin function CT16B1_MAT0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOSI1</name>
                  <description>Pin function MOSI1</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Pin function mode (on-chip pull-up/pull-down resistor control)</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor enabled)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYSTERESIS</name>
              <description>Hysteresis</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[9:6]</bitRange>
            </field>
            <field>
              <name>OPEN_DRAIN</name>
              <description>Selects pseudo open-drain mode</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>GPIO_OUTPUT</name>
                  <description>Standard GPIO output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_DRAIN_OUTPUT</name>
                  <description>Open-drain output</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON_PIO3_4</name>
          <description>I/O configuration for pin PIO3_4/ CT16B0_CAP1/RXD</description>
          <addressOffset>0x03C</addressOffset>
          <access>read-write</access>
          <resetValue>0xD0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FUNC</name>
              <description>Configure pin function</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>PIO3_4</name>
                  <description>Pin function PIO3_4</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT16B0_CAP1</name>
                  <description>Pin function CT16B0_CAP1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXD</name>
                  <description>Pin function RXD</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Pin function mode (on-chip pull-up/pull-down resistor control)</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor enabled)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYSTERESIS</name>
              <description>Hysteresis</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[9:6]</bitRange>
            </field>
            <field>
              <name>OPEN_DRAIN</name>
              <description>Selects pseudo open-drain mode</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>GPIO_OUTPUT</name>
                  <description>Standard GPIO output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_DRAIN_OUTPUT</name>
                  <description>Open-drain output</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON_PIO2_4</name>
          <description>I/O configuration for pin PIO2_4/ CT16B1_MAT1/ SSEL1</description>
          <addressOffset>0x040</addressOffset>
          <access>read-write</access>
          <resetValue>0xD0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FUNC</name>
              <description>Configure pin function</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>PIO2_4</name>
                  <description>Pin function PIO2_4</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT16B1_MAT1</name>
                  <description>Pin function CT16B1_MAT1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSEL1</name>
                  <description>Pin function SSEL1</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Pin function mode (on-chip pull-up/pull-down resistor control)</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor enabled)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYSTERESIS</name>
              <description>Hysteresis</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[9:6]</bitRange>
            </field>
            <field>
              <name>OPEN_DRAIN</name>
              <description>Selects pseudo open-drain mode</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>GPIO_OUTPUT</name>
                  <description>Standard GPIO output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_DRAIN_OUTPUT</name>
                  <description>Open-drain output</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON_PIO2_5</name>
          <description>I/O configuration for pin PIO2_5/ CT32B0_MAT0</description>
          <addressOffset>0x044</addressOffset>
          <access>read-write</access>
          <resetValue>0xD0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FUNC</name>
              <description>Configure pin function</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>PIO2_5</name>
                  <description>Pin function PIO2_5</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32B0_MAT0</name>
                  <description>Pin function CT32B0_MAT0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Pin function mode (on-chip pull-up/pull-down resistor control)</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor enabled)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYSTERESIS</name>
              <description>Hysteresis</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[9:6]</bitRange>
            </field>
            <field>
              <name>OPEN_DRAIN</name>
              <description>Selects pseudo open-drain mode</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>GPIO_OUTPUT</name>
                  <description>Standard GPIO output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_DRAIN_OUTPUT</name>
                  <description>Open-drain output</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON_PIO3_5</name>
          <description>I/O configuration for pin PIO3_5/ CT16B1_CAP1/TXD</description>
          <addressOffset>0x048</addressOffset>
          <access>read-write</access>
          <resetValue>0xD0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FUNC</name>
              <description>Configure pin function</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>PIO3_5</name>
                  <description>Pin function PIO3_5</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT16B1_CAP1</name>
                  <description>Pin function CT16B1_CAP1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXD</name>
                  <description>Pin function TXD</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Pin function mode (on-chip pull-up/pull-down resistor control)</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor enabled)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYSTERESIS</name>
              <description>Hysteresis</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[9:6]</bitRange>
            </field>
            <field>
              <name>OPEN_DRAIN</name>
              <description>Selects pseudo open-drain mode</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>GPIO_OUTPUT</name>
                  <description>Standard GPIO output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_DRAIN_OUTPUT</name>
                  <description>Open-drain output</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:11]</bitRange>
            </field>
          </fields>
        </register>
