TomCrypto/lpc11xx/svd/LPC11xx-v6-z0.xml
        <register>
          <name>IOCON_PIO0_8</name>
          <description>I/O configuration for pin PIO0_8/MISO0/CT16B0_MAT0</description>
          <addressOffset>0x060</addressOffset>
          <access>read-write</access>
          <resetValue>0xD0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FUNC</name>
              <description>Configure pin function</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>PIO0_8</name>
                  <description>Pin function PIO0_8</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MISO0</name>
                  <description>Pin function MISO0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT16B0_MAT0</name>
                  <description>Pin function CT16B0_MAT0</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Pin function mode (on-chip pull-up/pull-down resistor control)</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor enabled)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYSTERESIS</name>
              <description>Hysteresis</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[9:6]</bitRange>
            </field>
            <field>
              <name>OPEN_DRAIN</name>
              <description>Selects pseudo open-drain mode</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>GPIO_OUTPUT</name>
                  <description>Standard GPIO output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_DRAIN_OUTPUT</name>
                  <description>Open-drain output</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON_PIO0_9</name>
          <description>I/O configuration for pin PIO0_9/MOSI0/CT16B0_MAT1</description>
          <addressOffset>0x064</addressOffset>
          <access>read-write</access>
          <resetValue>0xD0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FUNC</name>
              <description>Configure pin function</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>PIO0_9</name>
                  <description>Pin function PIO0_9</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOSI0</name>
                  <description>Pin function MOSI0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT16B0_MAT1</name>
                  <description>Pin function CT16B0_MAT1</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Pin function mode (on-chip pull-up/pull-down resistor control)</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor enabled)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYSTERESIS</name>
              <description>Hysteresis</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[9:6]</bitRange>
            </field>
            <field>
              <name>OPEN_DRAIN</name>
              <description>Selects pseudo open-drain mode</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>GPIO_OUTPUT</name>
                  <description>Standard GPIO output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_DRAIN_OUTPUT</name>
                  <description>Open-drain output</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON_SWCLK_PIO0_10</name>
          <description>I/O configuration for pin SWCLK/PIO0_10/ SCK0/CT16B0_MAT2</description>
          <addressOffset>0x068</addressOffset>
          <access>read-write</access>
          <resetValue>0xD0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FUNC</name>
              <description>Configure pin function</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>SWCLK</name>
                  <description>Pin function SWCLK</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIO0_10</name>
                  <description>Pin function PIO0_10</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCK0</name>
                  <description>Pin function SCK0 (available depending on SCK location register)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT16B0_MAT2</name>
                  <description>Pin function CT16B0_MAT2</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Pin function mode (on-chip pull-up/pull-down resistor control)</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor enabled)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYSTERESIS</name>
              <description>Hysteresis</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[9:6]</bitRange>
            </field>
            <field>
              <name>OPEN_DRAIN</name>
              <description>Selects pseudo open-drain mode</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>GPIO_OUTPUT</name>
                  <description>Standard GPIO output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_DRAIN_OUTPUT</name>
                  <description>Open-drain output</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON_PIO1_10</name>
          <description>I/O configuration for pin PIO1_10/AD6/CT16B1_MAT1/ MISO1</description>
          <addressOffset>0x06C</addressOffset>
          <access>read-write</access>
          <resetValue>0xD0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FUNC</name>
              <description>Configure pin function</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>PIO1_10</name>
                  <description>Pin function PIO1_10</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AD6</name>
                  <description>Pin function AD6</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT16B1_MAT1</name>
                  <description>Pin function CT16B1_MAT1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MISO1</name>
                  <description>Pin function MISO1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Pin function mode (on-chip pull-up/pull-down resistor control)</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor enabled)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYSTERESIS</name>
              <description>Hysteresis</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADMODE</name>
              <description>Selects Analog/Digital mode</description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>ANALOG_INPUT_MODE</name>
                  <description>Analog input mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIGITAL_FUNCTIONAL_M</name>
                  <description>Digital functional mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>OPEN_DRAIN</name>
              <description>Selects pseudo open-drain mode</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>GPIO_OUTPUT</name>
                  <description>Standard GPIO output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_DRAIN_OUTPUT</name>
                  <description>Open-drain output</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON_PIO2_11</name>
          <description>I/O configuration for pin PIO2_11/SCK0/ CT32B0_CAP1</description>
          <addressOffset>0x070</addressOffset>
          <access>read-write</access>
          <resetValue>0xD0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FUNC</name>
              <description>Configure pin function</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>PIO2_11</name>
                  <description>Pin function PIO2_11</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_FUNCTION_SCK0</name>
                  <description>Pin function SCK0 (only if pin PIO2_11/SCK0 selected in Table 147)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32B0_CAP1</name>
                  <description>Pin function CT32B0_CAP1</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Pin function mode (on-chip pull-up/pull-down resistor control)</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor enabled)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYSTERESIS</name>
              <description>Hysteresis</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[9:6]</bitRange>
            </field>
            <field>
              <name>OPEN_DRAIN</name>
              <description>Selects pseudo open-drain mode</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>GPIO_OUTPUT</name>
                  <description>Standard GPIO output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_DRAIN_OUTPUT</name>
                  <description>Open-drain output</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:11]</bitRange>
            </field>
          </fields>
        </register>
