TomCrypto/lpc11xx/svd/LPC11xx-v6-z0.xml
        <register>
          <name>IOCON_PIO3_0</name>
          <description>I/O configuration for pin PIO3_0/DTR/CT16B0_MAT0/TXD</description>
          <addressOffset>0x084</addressOffset>
          <access>read-write</access>
          <resetValue>0xD0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FUNC</name>
              <description>Configure pin function</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>PIO3_0</name>
                  <description>Pin function PIO3_0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTR</name>
                  <description>Pin function DTR</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT16B0_MAT0</name>
                  <description>Pin function CT16B0_MAT0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXD</name>
                  <description>Pin function TXD</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Pin function mode (on-chip pull-up/pull-down resistor control)</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor enabled)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYSTERESIS</name>
              <description>Hysteresis</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[9:6]</bitRange>
            </field>
            <field>
              <name>OPEN_DRAIN</name>
              <description>Selects pseudo open-drain mode</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>GPIO_OUTPUT</name>
                  <description>Standard GPIO output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_DRAIN_OUTPUT</name>
                  <description>Open-drain output</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON_PIO3_1</name>
          <description>I/O configuration for pin PIO3_1/DSR/CT16B0_MAT1/RXD</description>
          <addressOffset>0x088</addressOffset>
          <access>read-write</access>
          <resetValue>0xD0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FUNC</name>
              <description>Configure pin function</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>PIO3_1</name>
                  <description>Pin function PIO3_1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSR</name>
                  <description>Pin function DSR</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT16B0_MAT1</name>
                  <description>Pin function CT16B0_MAT1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXD</name>
                  <description>Pin function RXD</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Pin function mode (on-chip pull-up/pull-down resistor control)</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor enabled)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYSTERESIS</name>
              <description>Hysteresis</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[9:6]</bitRange>
            </field>
            <field>
              <name>OPEN_DRAIN</name>
              <description>Selects pseudo open-drain mode</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>GPIO_OUTPUT</name>
                  <description>Standard GPIO output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_DRAIN_OUTPUT</name>
                  <description>Open-drain output</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON_PIO2_3</name>
          <description>I/O configuration for pin PIO2_3/RI/MOSI1</description>
          <addressOffset>0x08C</addressOffset>
          <access>read-write</access>
          <resetValue>0xD0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FUNC</name>
              <description>Configure pin function</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>PIO2_3</name>
                  <description>Pin function PIO2_3</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RI</name>
                  <description>Pin function RI</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOSI1</name>
                  <description>Pin function MOSI1</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Pin function mode (on-chip pull-up/pull-down resistor control)</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor enabled)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYSTERESIS</name>
              <description>Hysteresis</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[9:6]</bitRange>
            </field>
            <field>
              <name>OPEN_DRAIN</name>
              <description>Selects pseudo open-drain mode</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>GPIO_OUTPUT</name>
                  <description>Standard GPIO output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_DRAIN_OUTPUT</name>
                  <description>Open-drain output</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON_SWDIO_PIO1_3</name>
          <description>I/O configuration for pin SWDIO/PIO1_3/AD4/CT32B1_MAT2</description>
          <addressOffset>0x090</addressOffset>
          <access>read-write</access>
          <resetValue>0xD0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FUNC</name>
              <description>Configure pin function</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>SWDIO</name>
                  <description>Pin function SWDIO</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIO1_3</name>
                  <description>Pin function PIO1_3</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AD4</name>
                  <description>Pin function AD4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32B1_MAT2</name>
                  <description>Pin function CT32B1_MAT2</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Pin function mode (on-chip pull-up/pull-down resistor control)</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor enabled)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYSTERESIS</name>
              <description>Hysteresis</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADMODE</name>
              <description>Selects Analog/Digital mode</description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>ANALOG_INPUT_MODE</name>
                  <description>Analog input mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIGITAL_FUNCTIONAL_M</name>
                  <description>Digital functional mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>OPEN_DRAIN</name>
              <description>Selects pseudo open-drain mode</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>GPIO_OUTPUT</name>
                  <description>Standard GPIO output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_DRAIN_OUTPUT</name>
                  <description>Open-drain output</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON_PIO1_4</name>
          <description>I/O configuration for pin PIO1_4/AD5/CT32B1_MAT3</description>
          <addressOffset>0x094</addressOffset>
          <access>read-write</access>
          <resetValue>0xD0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FUNC</name>
              <description>Selects pin function. This pin functions as WAKEUP pin if the LPC111x/LPC11Cxx is in Deep power-down mode regardless of the value of FUNC. All other values are reserved</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>PIO1_4</name>
                  <description>Pin function PIO1_4</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AD5</name>
                  <description>Pin function AD5</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT32B1_MAT3</name>
                  <description>Pin function CT32B1_MAT3</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Pin function mode (on-chip pull-up/pull-down resistor control)</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor enabled)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYSTERESIS</name>
              <description>Hysteresis</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADMODE</name>
              <description>Selects Analog/Digital mode</description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>ANALOG_INPUT_MODE</name>
                  <description>Analog input mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIGITAL_FUNCTIONAL_M</name>
                  <description>Digital functional mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>OPEN_DRAIN</name>
              <description>Selects pseudo open-drain mode</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>GPIO_OUTPUT</name>
                  <description>Standard GPIO output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_DRAIN_OUTPUT</name>
                  <description>Open-drain output</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:11]</bitRange>
            </field>
          </fields>
        </register>
