TomCrypto/lpc11xx/svd/LPC11xx-v6-z0.xml
        <register>
          <name>IOCON_PIO3_3</name>
          <description>I/O configuration for pin PIO3_3/RI/ CT16B0_CAP0</description>
          <addressOffset>0x0AC</addressOffset>
          <access>read-write</access>
          <resetValue>0xD0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FUNC</name>
              <description>Configure pin function</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>PIO3_3</name>
                  <description>Pin function PIO3_3</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RI</name>
                  <description>Pin function RI</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT16B0_CAP0</name>
                  <description>Pin function CT16B0_CAP0</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Pin function mode (on-chip pull-up/pull-down resistor control)</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor enabled)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYSTERESIS</name>
              <description>Hysteresis</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[9:6]</bitRange>
            </field>
            <field>
              <name>OPEN_DRAIN</name>
              <description>Selects pseudo open-drain mode</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>GPIO_OUTPUT</name>
                  <description>Standard GPIO output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_DRAIN_OUTPUT</name>
                  <description>Open-drain output</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON_SCK0_LOC</name>
          <description>SCK0 pin location select register</description>
          <addressOffset>0x0B0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCKLOC</name>
              <description>Selects pin location for SCK0 function</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>PIO0_10</name>
                  <description>Function SCK0 is available for pin PIO0_10</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIO2_11</name>
                  <description>Function SCK0 is available for pin PIO2_11</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIO0_6</name>
                  <description>Function SCK0 is available for pin PIO0_6</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON_DSR_LOC</name>
          <description>DSR pin location select register</description>
          <addressOffset>0x0B4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DSRLOC</name>
              <description>Selects pin location for DSR function</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>PIO2_1</name>
                  <description>Function DSR is available for pin PIO2_1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIO3_1</name>
                  <description>Function DSR is available for pin PIO3_1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON_DCD_LOC</name>
          <description>DCD pin location select register</description>
          <addressOffset>0x0B8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCDLOC</name>
              <description>Selects pin location for DCD function</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>PIO2_2</name>
                  <description>Function DCD is available for pin PIO2_2</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIO3_2</name>
                  <description>Function DCD is available for pin PIO3_2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON_RI_LOC</name>
          <description>RI pin location select register</description>
          <addressOffset>0x0BC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RILOC</name>
              <description>Selects pin location for RI function</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>PIO2_3</name>
                  <description>Function RI is available for pin PIO2_3</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIO3_3</name>
                  <description>Function RI is available for pin PIO3_3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON_SSEL1_LOC</name>
          <description>SSEL1 pin location select register</description>
          <addressOffset>0x018</addressOffset>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SSEL1LOC</name>
              <description>Selects pin location for SSEL1 function</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>PIO2_2</name>
                  <description>Function SSEL1 is available for pin PIO2_2</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIO2_4</name>
                  <description>Function SSEL1 is available for pin PIO2_4</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON_CT16B0_CAP0_LOC</name>
          <description>CT16B0_CAP0 pin location select register</description>
          <addressOffset>0x0C0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CT16B0_CAP0LOC</name>
              <description>Selects pin location for CT16B0_CAP0 function</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>PIO0_2</name>
                  <description>Function CT16B0_CAP0 is available for pin PIO0_2</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIO3_3</name>
                  <description>Function CT16B0_CAP0 is available for pin PIO3_3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON_SCK1_LOC</name>
          <description>SCK1 pin location select register</description>
          <addressOffset>0x0C4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCK1LOC</name>
              <description>Selects pin location for SCK1 function</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>PIO2_1</name>
                  <description>Function SCK1 is available for pin PIO2_1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIO3_2</name>
                  <description>Function SCK1 is available for pin PIO3_2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON_MISO1_LOC</name>
          <description>MISO1 pin location select register</description>
          <addressOffset>0x0C8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MISO1LOC</name>
              <description>Selects pin location for the MISO1 function</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>PIO2_2</name>
                  <description>Function MISO1 is available for pin PIO2_2</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIO1_10</name>
                  <description>Function MISO1 is available for pin PIO1_10</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON_MOSI1_LOC</name>
          <description>MOSI1 pin location select register</description>
          <addressOffset>0x0CC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MOSI1LOC</name>
              <description>Selects pin location for the MOSI1 function</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>PIO2_3</name>
                  <description>Function MOSI1 is available for pin PIO2_3</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIO1_9</name>
                  <description>Function MOSI1 is available for pin PIO1_9</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON_CT32B0_CAP0_LOC</name>
          <description>CT32B0_CAP0 pin location select register</description>
          <addressOffset>0x0D0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CT32B0_CAP0LOC</name>
              <description>Selects pin location for the CT32B0_CAP0 function</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>PIO1_5</name>
                  <description>Function CT32B0_CAP0 is available for pin PIO1_5</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIO2_9</name>
                  <description>Function CT32B0_CAP0 is available for pin PIO2_9</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON_RXD_LOC</name>
          <description>RXD pin location select register</description>
          <addressOffset>0x0D4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDLOC</name>
              <description>Selects pin location for the RXD function</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>PIO1_6</name>
                  <description>Function RXD is available for pin PIO1_6</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIO2_7</name>
                  <description>Function RXD is available for pin PIO2_7</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIO3_1</name>
                  <description>Function RXD is available for pin PIO3_1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIO3_4</name>
                  <description>Function RXD is available for pin PIO3_4</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
