TomCrypto/lpc11xx/svd/LPC11xx-v6-z0.xml
        <register>
          <name>MAINCLKSEL</name>
          <description>Main clock source select</description>
          <addressOffset>0x070</addressOffset>
          <access>read-write</access>
          <resetValue>0x000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Clock source for main clock</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>IRC_OSCILLATOR</name>
                  <description>IRC oscillator</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_CLOCK_TO_SYSTE</name>
                  <description>Input clock to system PLL</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDT_OSCILLATOR</name>
                  <description>WDT oscillator</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSTEM_PLL_CLOCK_OUT</name>
                  <description>System PLL clock out</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MAINCLKUEN</name>
          <description>Main clock source update enable</description>
          <addressOffset>0x074</addressOffset>
          <access>read-write</access>
          <resetValue>0x000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENA</name>
              <description>Enable main clock source update</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>NO_CHANGE</name>
                  <description>No change</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDATE_CLOCK_SOURCE</name>
                  <description>Update clock source</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSAHBCLKDIV</name>
          <description>System AHB clock divider</description>
          <addressOffset>0x078</addressOffset>
          <access>read-write</access>
          <resetValue>0x001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>System AHB clock divider values 0: System clock disabled. 1: Divide by 1. to 255: Divide by 255</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSAHBCLKCTRL</name>
          <description>System AHB clock control</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <resetValue>0x85F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SYS</name>
              <description>Clock control for AHB to APB bridge, to the AHB matrix, to the Cortex-M0 FCLK and HCLK, to the SysCon, and to the PMU (this bit is read-only)</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>RESERVED</name>
                  <description>Reserved</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ROM</name>
              <description>Clock control for ROM</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM</name>
              <description>Clock control for RAM</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASHREG</name>
              <description>Clock control for the flash register interface</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASHARRAY</name>
              <description>Clock control for flash array access</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C</name>
              <description>Clock control for I2C</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO</name>
              <description>Clock control for GPIO</description>
              <bitRange>[6:6]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CT16B0</name>
              <description>Clock control for CT16B0</description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CT16B1</name>
              <description>Clock control for CT16B1</description>
              <bitRange>[8:8]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CT32B0</name>
              <description>Clock control for CT32B0</description>
              <bitRange>[9:9]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CT32B1</name>
              <description>Clock control for CT32B1</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSP0</name>
              <description>Clock control for SPI0</description>
              <bitRange>[11:11]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UART</name>
              <description>Clock control for UART</description>
              <bitRange>[12:12]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC</name>
              <description>Clock control for ADC</description>
              <bitRange>[13:13]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>WDT</name>
              <description>Clock control for WDT</description>
              <bitRange>[15:15]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOCON</name>
              <description>Clock control for the I/O configuration block</description>
              <bitRange>[16:16]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAN</name>
              <description>Clock control for C_CAN</description>
              <bitRange>[17:17]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSP1</name>
              <description>Clock control for SPI1</description>
              <bitRange>[18:18]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:19]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSP0CLKDIV</name>
          <description>SPI0 clock divider</description>
          <addressOffset>0x094</addressOffset>
          <access>read-write</access>
          <resetValue>0x000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>SPI0_PCLK clock divider values 0: Disable SPI0_PCLK. 1: Divide by 1. to 255: Divide by 255</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UARTCLKDIV</name>
          <description>UART clock divder</description>
          <addressOffset>0x098</addressOffset>
          <access>read-write</access>
          <resetValue>0x000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>UART_PCLK clock divider values 0: Disable UART_PCLK. 1: Divide by 1. to 255: Divide by 255</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSP1CLKDIV</name>
          <description>SPI1 clock divder</description>
          <addressOffset>0x09C</addressOffset>
          <access>read-write</access>
          <resetValue>0x000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>SPI1_PCLK clock divider values 0: Disable SPI1_PCLK. 1: Divide by 1. to 255: Divide by 255</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTCLKSEL</name>
          <description>WDT clock source select</description>
          <addressOffset>0x0D0</addressOffset>
          <access>read-write</access>
          <resetValue>0x000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>WDT clock source</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>IRC_OSCILLATOR</name>
                  <description>IRC oscillator</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAIN_CLOCK</name>
                  <description>Main clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WATCHDOG_OSCILLATOR</name>
                  <description>Watchdog oscillator</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTCLKUEN</name>
          <description>WDT clock source update enable</description>
          <addressOffset>0x0D4</addressOffset>
          <access>read-write</access>
          <resetValue>0x000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENA</name>
              <description>Enable WDT clock source update</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>NO_CHANGE</name>
                  <description>No change</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDATE_CLOCK_SOURCE</name>
                  <description>Update clock source</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTCLKDIV</name>
          <description>WDT clock divider</description>
          <addressOffset>0x0D8</addressOffset>
          <access>read-write</access>
          <resetValue>0x000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>WDT clock divider values 0: Disable WDCLK. 1: Divide by 1. to 255: Divide by 255</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKOUTCLKSEL</name>
          <description>CLKOUT clock source select</description>
          <addressOffset>0x0E0</addressOffset>
          <access>read-write</access>
          <resetValue>0x000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>CLKOUT clock source</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>IRC_OSCILLATOR</name>
                  <description>IRC oscillator</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSTEM_OSCILLATOR</name>
                  <description>System oscillator</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WATCHDOG_OSCILLATOR</name>
                  <description>Watchdog oscillator</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAIN_CLOCK</name>
                  <description>Main clock</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
