TomCrypto/lpc11xx/svd/LPC11xx-v6-z0.xml
        <register>
          <name>CLKOUTUEN</name>
          <description>CLKOUT clock source update enable</description>
          <addressOffset>0x0E4</addressOffset>
          <access>read-write</access>
          <resetValue>0x000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENA</name>
              <description>Enable CLKOUT clock source update</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>NO_CHANGE</name>
                  <description>No change</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDATE_CLOCK_SOURCE</name>
                  <description>Update clock source</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKOUTCLKDIV</name>
          <description>CLKOUT clock divider</description>
          <addressOffset>0x0E8</addressOffset>
          <access>read-write</access>
          <resetValue>0x000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>Clock output divider values 0: Disable CLKOUT. 1: Divide by 1. to 255: Divide by 255</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PIOPORCAP0</name>
          <description>POR captured PIO status 0</description>
          <addressOffset>0x100</addressOffset>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>CAPPIO0_n</name>
              <description>Raw reset status input PIO0_n: PIO0_11 to PIO0_0</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>CAPPIO1_n</name>
              <description>Raw reset status input PIO1_n: PIO1_11 to PIO1_0</description>
              <bitRange>[23:12]</bitRange>
            </field>
            <field>
              <name>CAPPIO2_n</name>
              <description>Raw reset status input PIO2_n: PIO2_7 to PIO2_0</description>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PIOPORCAP1</name>
          <description>POR captured PIO status 1</description>
          <addressOffset>0x104</addressOffset>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>CAPPIO2_8</name>
              <description>Raw reset status input PIO2_8</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CAPPIO2_9</name>
              <description>Raw reset status input PIO2_9</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CAPPIO2_10</name>
              <description>Raw reset status input PIO2_10</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CAPPIO2_11</name>
              <description>Raw reset status input PIO2_11</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CAPPIO3_0</name>
              <description>Raw reset status input PIO3_0</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CAPPIO3_1</name>
              <description>Raw reset status input PIO3_1</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CAPPIO3_2</name>
              <description>Raw reset status input PIO3_2</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CAPPIO3_3</name>
              <description>Raw reset status input PIO3_3</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CAPPIO3_4</name>
              <description>Raw reset status input PIO3_4</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CAPPIO3_5</name>
              <description>Raw reset status input PIO3_5</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BODCTRL</name>
          <description>BOD control</description>
          <addressOffset>0x150</addressOffset>
          <access>read-write</access>
          <resetValue>0x000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BODRSTLEV</name>
              <description>BOD reset level</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>LEVEL_0_THE_RESET_A</name>
                  <description>Level 0: The reset assertion threshold voltage is 1.46 V; the reset de-assertion threshold voltage is 1.63 V</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL_1_THE_RESET_A</name>
                  <description>Level 1: The reset assertion threshold voltage is 2.06 V; the reset de-assertion threshold voltage is 2.15 V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL_2_THE_RESET_A</name>
                  <description>Level 2: The reset assertion threshold voltage is 2.35 V; the reset de-assertion threshold voltage is 2.43 V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL_3_THE_RESET_A</name>
                  <description>Level 3: The reset assertion threshold voltage is 2.63 V; the reset de-assertion threshold voltage is 2.71 V</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BODINTVAL</name>
              <description>BOD interrupt level</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>LEVEL_0_THE_INTERRU</name>
                  <description>Level 0: The interrupt assertion threshold voltage is 1.65 V; the interrupt de-assertion threshold voltage is 1.80 V</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL_1THE_INTERRUP</name>
                  <description>Level 1:The interrupt assertion threshold voltage is 2.22 V; the interrupt de-assertion threshold voltage is 2.35 V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL_2_THE_INTERRU</name>
                  <description>Level 2: The interrupt assertion threshold voltage is 2.52 V; the interrupt de-assertion threshold voltage is 2.66 V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL_3_THE_INTERRU</name>
                  <description>Level 3: The interrupt assertion threshold voltage is 2.80 V; the interrupt de-assertion threshold voltage is 2.90 V</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BODRSTENA</name>
              <description>BOD reset enable</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DISABLE_RESET_FUNCTI</name>
                  <description>Disable reset function</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_RESET_FUNCTIO</name>
                  <description>Enable reset function</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSTCKCAL</name>
          <description>System tick counter calibration</description>
          <addressOffset>0x154</addressOffset>
          <access>read-write</access>
          <resetValue>0x004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAL</name>
              <description>System tick timer calibration value</description>
              <bitRange>[25:0]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NMISRC</name>
          <description>NMI source selection</description>
          <addressOffset>0x174</addressOffset>
          <access>read-write</access>
          <resetValue>0x000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQNO</name>
              <description>The IRQ number of the interrupt that acts as the Non-Maskable Interrupt (NMI) if bit 31 in this register is 1. See Table 54 for the list of interrupt sources and their IRQ numbers</description>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[30:5]</bitRange>
            </field>
            <field>
              <name>NMIEN</name>
              <description>Write a 1 to this bit to enable the Non-Maskable Interrupt (NMI) source selected by bits 4:0</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STARTAPRP0</name>
          <description>Start logic edge control register 0</description>
          <addressOffset>0x200</addressOffset>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>APRPIO0_0</name>
              <description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>APRPIO0_1</name>
              <description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>APRPIO0_2</name>
              <description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>APRPIO0_3</name>
              <description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>APRPIO0_4</name>
              <description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>APRPIO0_5</name>
              <description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>APRPIO0_6</name>
              <description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>APRPIO0_7</name>
              <description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>APRPIO0_8</name>
              <description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>APRPIO0_9</name>
              <description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>APRPIO0_10</name>
              <description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>APRPIO0_11</name>
              <description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>APRPIO1_0</name>
              <description>Edge select for start logic input PIO1_0 0 = Falling edge 1 = Rising edge</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved. Do not write a 1 to reserved bits in this register</description>
              <bitRange>[31:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STARTERP0</name>
          <description>Start logic signal enable register 0</description>
          <addressOffset>0x204</addressOffset>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ERPIO0_0</name>
              <description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ERPIO0_1</name>
              <description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ERPIO0_2</name>
              <description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ERPIO0_3</name>
              <description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ERPIO0_4</name>
              <description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ERPIO0_5</name>
              <description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ERPIO0_6</name>
              <description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ERPIO0_7</name>
              <description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ERPIO0_8</name>
              <description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ERPIO0_9</name>
              <description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ERPIO0_10</name>
              <description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ERPIO0_11</name>
              <description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ERPIO1_0</name>
              <description>Enable start signal for start logic input PIO1_0 0 = Disabled 1 = Enabled</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved. Do not write a 1 to reserved bits in this register</description>
              <bitRange>[31:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STARTRSRP0CLR</name>
          <description>Start logic reset register 0</description>
          <addressOffset>0x208</addressOffset>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>RSRPIO0_0</name>
              <description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RSRPIO0_1</name>
              <description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RSRPIO0_2</name>
              <description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RSRPIO0_3</name>
              <description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RSRPIO0_4</name>
              <description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RSRPIO0_5</name>
              <description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RSRPIO0_6</name>
              <description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RSRPIO0_7</name>
              <description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RSRPIO0_8</name>
              <description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RSRPIO0_9</name>
              <description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RSRPIO0_10</name>
              <description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RSRPIO0_11</name>
              <description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>RSRPIO1_0</name>
              <description>Start signal reset for start logic input PIO1_0 0 = Do nothing. 1 = Writing 1 resets the start signal</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved. Do not write a 1 to reserved bits in this register</description>
              <bitRange>[31:13]</bitRange>
            </field>
          </fields>
        </register>
