TomCrypto/lpc11xx/svd/LPC11xx-v6-z0.xml
        <register>
          <name>STARTSRP0</name>
          <description>Start logic status register 0</description>
          <addressOffset>0x20C</addressOffset>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>SRPIO0_0</name>
              <description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SRPIO0_1</name>
              <description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SRPIO0_2</name>
              <description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SRPIO0_3</name>
              <description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SRPIO0_4</name>
              <description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SRPIO0_5</name>
              <description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SRPIO0_6</name>
              <description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SRPIO0_7</name>
              <description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SRPIO0_8</name>
              <description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SRPIO0_9</name>
              <description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SRPIO0_10</name>
              <description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SRPIO0_11</name>
              <description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SRPIO1_0</name>
              <description>Start signal status for start logic input PIO1_0 0 = No start signal received. 1 = Start signal pending</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PDSLEEPCFG</name>
          <description>Power-down states in Deep-sleep mode</description>
          <addressOffset>0x230</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NOTUSED0</name>
              <description>Reserved. Always write these bits as 111</description>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>BOD_PD</name>
              <description>BOD power-down control in Deep-sleep mode, see Table 40</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>POWERED</name>
                  <description>Powered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWERED_DOWN</name>
                  <description>Powered down</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NOTUSED1</name>
              <description>Reserved. Always write these bits as 11</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>WDTOSC_PD</name>
              <description>Watchdog oscillator power control in Deep-sleep mode, see Table 40</description>
              <bitRange>[6:6]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>POWERED</name>
                  <description>Powered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWERED_DOWN</name>
                  <description>Powered down</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NOTUSED2</name>
              <description>Reserved. Always write this bit as 1</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>NOTUSED3</name>
              <description>Reserved. Always write these bits as 000</description>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>NOTUSED4</name>
              <description>Reserved. Always write these bits as 11</description>
              <bitRange>[12:11]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PDAWAKECFG</name>
          <description>Power-down states after wake-up from Deep-sleep mode</description>
          <addressOffset>0x234</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000EDF0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRCOUT_PD</name>
              <description>IRC oscillator output wake-up configuration</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>POWERED</name>
                  <description>Powered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWERED_DOWN</name>
                  <description>Powered down</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRC_PD</name>
              <description>IRC oscillator power-down wake-up configuration</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>POWERED</name>
                  <description>Powered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWERED_DOWN</name>
                  <description>Powered down</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_PD</name>
              <description>Flash wake-up configuration</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>POWERED</name>
                  <description>Powered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWERED_DOWN</name>
                  <description>Powered down</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOD_PD</name>
              <description>BOD wake-up configuration</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>POWERED</name>
                  <description>Powered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWERED_DOWN</name>
                  <description>Powered down</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_PD</name>
              <description>ADC wake-up configuration</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>POWERED</name>
                  <description>Powered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWERED_DOWN</name>
                  <description>Powered down</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSOSC_PD</name>
              <description>System oscillator wake-up configuration</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>POWERED</name>
                  <description>Powered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWERED_DOWN</name>
                  <description>Powered down</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDTOSC_PD</name>
              <description>Watchdog oscillator wake-up configuration</description>
              <bitRange>[6:6]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>POWERED</name>
                  <description>Powered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWERED_DOWN</name>
                  <description>Powered down</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSPLL_PD</name>
              <description>System PLL wake-up configuration</description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>POWERED</name>
                  <description>Powered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWERED_DOWN</name>
                  <description>Powered down</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NOTUSED0</name>
              <description>Reserved. Always write this bit as 1</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>NOTUSED1</name>
              <description>Reserved. Always write this bit as 0</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>NOTUSED2</name>
              <description>Reserved. Always write this bit as 1</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>NOTUSED3</name>
              <description>Reserved. Always write this bit as 1</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>NOTUSED4</name>
              <description>Reserved. Always write this bit as 0</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>NOTUSED5</name>
              <description>Reserved. Always write these bits as 111</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PDRUNCFG</name>
          <description>Power-down configuration register</description>
          <addressOffset>0x238</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000EDF0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRCOUT_PD</name>
              <description>IRC oscillator output power-down</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>POWERED</name>
                  <description>Powered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWERED_DOWN</name>
                  <description>Powered down</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRC_PD</name>
              <description>IRC oscillator power-down</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>POWERED</name>
                  <description>Powered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWERED_DOWN</name>
                  <description>Powered down</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_PD</name>
              <description>Flash power-down</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>POWERED</name>
                  <description>Powered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWERED_DOWN</name>
                  <description>Powered down</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOD_PD</name>
              <description>BOD power-down</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>POWERED</name>
                  <description>Powered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWERED_DOWN</name>
                  <description>Powered down</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_PD</name>
              <description>ADC power-down</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>POWERED</name>
                  <description>Powered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWERED_DOWN</name>
                  <description>Powered down</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSOSC_PD</name>
              <description>System oscillator power-down</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>POWERED</name>
                  <description>Powered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWERED_DOWN</name>
                  <description>Powered down</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDTOSC_PD</name>
              <description>Watchdog oscillator power-down</description>
              <bitRange>[6:6]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>POWERED</name>
                  <description>Powered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWERED_DOWN</name>
                  <description>Powered down</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSPLL_PD</name>
              <description>System PLL power-down</description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>POWERED</name>
                  <description>Powered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWERED_DOWN</name>
                  <description>Powered down</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NOTUSED0</name>
              <description>Reserved. Always write this bit as 1</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>NOTUSED1</name>
              <description>Reserved. Always write this bit as 0</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>NOTUSED2</name>
              <description>Reserved. Always write this bit as 1</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>NOTUSED3</name>
              <description>Reserved. Always write this bit as 1</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>NOTUSED4</name>
              <description>Reserved. Always write this bit as 0</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>NOTUSED5</name>
              <description>Reserved. Always write these bits as 111</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVICE_ID</name>
          <description>Device ID register 0 for parts LPC1100, LPC1100C, LPC1100L</description>
          <addressOffset>0x3F4</addressOffset>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>DEVICEID</name>
              <description>Part ID numbers for LPC111x/LPC11Cxx parts 0x041E 502B; 0x2516 D02B = LPC1111FHN33/101 0x2516 D02B = LPC1111FHN33/102 0x0416 502B; 0x2516 902B = LPC1111FHN33/201 0x2516 902B = LPC1111FHN33/202 0x042D 502B; 0x2524 D02B = LPC1112FHN33/101 0x2524 D02B = LPC1112FHN33/102 0x0425 502B; 0x2524 902B = LPC1112FHN33/201 0x2524 902B = LPC1112FHN33/202 0x2524 902B = LPC1112FHI33/202 0x0434 502B; 0x2532 902B = LPC1113FHN33/201 0x2532 902B = LPC1113FHN33/202 0x0434 102B; 0x2532 102B = LPC1113FHN33/301 0x2532 102B = LPC1113FHN33/302 0x0434 102B; 0x2532 102B = LPC1113FBD48/301 0x2532 102B = LPC1113FBD48/302 0x0444 502B; 0x2540 902B = LPC1114FHN33/201 0x2540 902B = LPC1114FHN33/202 0x0444 102B; 0x2540 102B = LPC1114FHN33/301 0x2540 102B = LPC1114FHN33/302 0x2540 102B = LPC1114FHI33/302 0x0444 102B; 0x2540 102B = LPC1114FBD48/301 0x2540 102B = LPC1114FBD48/302 0x2540 102B = LPC11D14FBD100/302 0x1421 102B = LPC11C12/FBD48/301 0x1440 102B = LPC11C14/FBD48/301 0x1431 102B = LPC11C22/FBD48/301 0X1430 102B = LPC11C24/FBD48/301</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
