TomCrypto/lpc11xx/svd/LPC11xx-v6-z0.xml
        <register>
          <name>CANBRPE</name>
          <description>Baud rate prescaler extension register</description>
          <addressOffset>0x018</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BRPE</name>
              <description>Baud rate prescaler extension By programming BRPE the Baud Rate Prescaler can be extended to values up to 1023. Hardware interprets the value as the value of BRPE (MSBs) and BRP (LSBs) plus one. Allowed values are 0 to 15</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x60</dimIncrement>
          <dimIndex>1-2</dimIndex>
          <name>CANIF%s_CMDREQ</name>
          <description>Message interface command request</description>
          <addressOffset>0x020</addressOffset>
          <access>read-write</access>
          <resetValue>0x0001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MN</name>
              <description>Message number 0x01 - 0x20 = Valid message numbers. The message object in the message RAM is selected for data transfer. 0x00 = Not a valid message number. This value is interpreted as 0x20.[1] 0x21 - 0x3F = Not a valid message number. This value is interpreted as 0x01 - 0x1F.[1]</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>reserved</description>
              <bitRange>[14:6]</bitRange>
            </field>
            <field>
              <name>BUSY</name>
              <description>BUSY flag</description>
              <bitRange>[15:15]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Set to zero by hardware when read/write action to this Command request register has finished</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Set to one by hardware when writing to this Command request register</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x60</dimIncrement>
          <dimIndex>1-2</dimIndex>
          <name>CANIF%s_CMDMSK_W</name>
          <description>Message interface command mask - write direction</description>
          <addressOffset>0x024</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_B</name>
              <description>Access data bytes 4-7</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DATA_BYTES_4_7_UNCHA</name>
                  <description>Data bytes 4-7 unchanged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSFER_DATA_BYTES_</name>
                  <description>Transfer data bytes 4-7 to message object</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATA_A</name>
              <description>Access data bytes 0-3</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>DATA_BYTES_0_3_UNCHA</name>
                  <description>Data bytes 0-3 unchanged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSFER_DATA_BYTES_</name>
                  <description>Transfer data bytes 0-3 to message object</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXRQST</name>
              <description>Access transmission request bit</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>NO_TRANSMISSION_REQU</name>
                  <description>No transmission request. TXRQSRT bit unchanged in IF1/2_MCTRL. If a transmission is requested by programming this bit, the TXRQST bit in the CANIFn_MCTRL register is ignored</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQUEST_A_TRANSMISSI</name>
                  <description>Request a transmission. Set the TXRQST bit IF1/2_MCTRL</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRINTPND</name>
              <description>This bit is ignored in the write direction</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CTRL</name>
              <description>Access control bits</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Control bits unchanged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSFER_CONTROL_BIT</name>
                  <description>Transfer control bits to message object</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ARB</name>
              <description>Access arbitration bits</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Arbitration bits unchanged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSFER_IDENTIFIER</name>
                  <description>Transfer Identifier, DIR, XTD, and MSGVAL bits to message object</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASK</name>
              <description>Access mask bits</description>
              <bitRange>[6:6]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Mask bits unchanged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSFER_IDENTIFIER_</name>
                  <description>Transfer Identifier MASK + MDIR + MXTD to message object</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WR_RD</name>
              <description>Write transfer Transfer data from the selected message buffer registers to the message object addressed by the command request register CANIFn_CMDREQ</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>reserved</description>
              <bitRange>[31:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x60</dimIncrement>
          <dimIndex>1-2</dimIndex>
          <name>CANIF%s_CMDMSK_R</name>
          <description>Message interface command mask - read direction</description>
          <alternateRegister>CANIF%s_CMDMSK_W</alternateRegister>
          <addressOffset>0x024</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_B</name>
              <description>Access data bytes 4-7</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Data bytes 4-7 unchanged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSFER_DATA_BYTES_</name>
                  <description>Transfer data bytes 4-7 to IFx message buffer register</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATA_A</name>
              <description>Access data bytes 0-3</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Data bytes 0-3 unchanged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSFER_DATA_BYTES_</name>
                  <description>Transfer data bytes 0-3 to IFx message buffer</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NEWDAT</name>
              <description>Access new data bit</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>NEWDAT bit remains unchanged. A read access to a message object can be combined with the reset of the control bits INTPND and NEWDAT in IF1/2_MCTRL. The values of these bits transferred to the IFx Message Control Register always reflect the status before resetting these bits</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_NEWDAT_BIT_IN_</name>
                  <description>Clear NEWDAT bit in the message object</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRINTPND</name>
              <description>Clear interrupt pending bit</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>INTPND bit remains unchanged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_INTPND_BIT_IN_</name>
                  <description>Clear INTPND bit in the message object</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTRL</name>
              <description>Access control bits</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Control bits unchanged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSFER_CONTROL_BIT</name>
                  <description>Transfer control bits to IFx message buffer</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ARB</name>
              <description>Access arbitration bits</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Arbitration bits unchanged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSFER_IDENTIFIER</name>
                  <description>Transfer Identifier, DIR, XTD, and MSGVAL bits to IFx message buffer register</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASK</name>
              <description>Access mask bits</description>
              <bitRange>[6:6]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>UNCHANGED</name>
                  <description>Mask bits unchanged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSFER_IDENTIFIER_</name>
                  <description>Transfer Identifier MASK + MDIR + MXTD to IFx message buffer register</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WR_RD</name>
              <description>Read transfer Transfer data from the message object addressed by the command request register to the selected message buffer registers CANIFn_CMDREQ</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>reserved</description>
              <bitRange>[31:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x60</dimIncrement>
          <dimIndex>1-2</dimIndex>
          <name>CANIF%s_MSK1</name>
          <description>Message interface 1 mask 1</description>
          <addressOffset>0x028</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MSK_15_0</name>
              <description>Identifier mask</description>
              <bitRange>[15:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>NOINHIBIT</name>
                  <description>The corresponding bit in the identifier of the message can not inhibit the match in the acceptance filtering</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACCEPTANCEFILTERING</name>
                  <description>The corresponding identifier bit is used for acceptance filtering</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>reserved</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x60</dimIncrement>
          <dimIndex>1-2</dimIndex>
          <name>CANIF%s_MSK2</name>
          <description>Message interface 1 mask 2</description>
          <addressOffset>0x02C</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MSK_28_16</name>
              <description>Identifier mask</description>
              <bitRange>[12:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>NOINHIBIT</name>
                  <description>The corresponding bit in the identifier of the message can not inhibit the match in the acceptance filtering</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACCEPTANCEFILTERING</name>
                  <description>The corresponding identifier bit is used for acceptance filtering</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>MDIR</name>
              <description>Mask message direction</description>
              <bitRange>[14:14]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>NOEFFECT</name>
                  <description>The message direction bit (DIR) has no effect on acceptance filtering</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACCEPTANCEFILTERING</name>
                  <description>The message direction bit (DIR) is used for acceptance filtering</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MXTD</name>
              <description>Mask extend identifier</description>
              <bitRange>[15:15]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>NOEFFECT</name>
                  <description>The extended identifier bit (XTD) has no effect on acceptance filtering</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACCEPTANCEFILTERING</name>
                  <description>The extended identifier bit (XTD) is used for acceptance filtering</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x60</dimIncrement>
          <dimIndex>1-2</dimIndex>
          <name>CANIF%s_ARB1</name>
          <description>Message interface 1 arbitration 1</description>
          <addressOffset>0x030</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ID_15_0</name>
              <description>Message identifier 29-bit identifier (extended frame) 11-bit identifier (standard frame)</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
