TomCrypto/lpc11xx/svd/LPC11xx-v6-z0.xml
        <register>
          <dim>2</dim>
          <dimIncrement>0x60</dimIncrement>
          <dimIndex>1-2</dimIndex>
          <name>CANIF%s_ARB2</name>
          <description>Message interface 1 arbitration 2</description>
          <addressOffset>0x034</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ID_28_16</name>
              <description>Message identifier 29-bit identifier (extended frame) 11-bit identifier (standard frame)</description>
              <bitRange>[12:0]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <description>Message direction</description>
              <bitRange>[13:13]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>RECEIVE</name>
                  <description>Direction = receive. On TXRQST, a Remote Frame with the identifier of this Message Object is transmitted. On reception of a Data Frame with matching identifier, that message is stored in this Message Object</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSMIT</name>
                  <description>Direction = transmit. On TXRQST, the respective Message Object is transmitted as a Data Frame. On reception of a Remote Frame with matching identifier, the TXRQST bit of this Message Object is set (if RMTEN = one)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTD</name>
              <description>Extend identifier</description>
              <bitRange>[14:14]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>11_BIT_STANDARD_</name>
                  <description>The 11-bit standard identifier will be used for this message object</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>29_BIT_EXTENDED_</name>
                  <description>The 29-bit extended identifier will be used for this message object</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSGVAL</name>
              <description>Message valid The CPU must reset the MSGVAL bit of all unused Messages Objects during the initialization before it resets bit INIT in the CAN Control Register. This bit must also be reset before the identifier ID28:0, the control bits XTD, DIR, or the Data Length Code DLC3:0 are modified, or if the Messages Object is no longer required</description>
              <bitRange>[15:15]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>IGNORE</name>
                  <description>The message object is ignored by the message handler</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONFIGURED</name>
                  <description>The message object is configured and should be considered by the message handler</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x60</dimIncrement>
          <dimIndex>1-2</dimIndex>
          <name>CANIF%s_MCTRL</name>
          <description>Message interface 1 message control</description>
          <addressOffset>0x038</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DLC_3_0</name>
              <description>Data length code The Data Length Code of a Message Object must be defined the same as in all the corresponding objects with the same identifier at other nodes. When the Message Handler stores a data frame, it will write the DLC to the value given by the received message. 0000 - 1000 = Data frame has 0 - 8 data bytes. 1001 - 1111 = Data frame has 8 data bytes</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>reserved</description>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>EOB</name>
              <description>End of buffer</description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>FIFO</name>
                  <description>Message object belongs to a FIFO buffer and is not the last message object of that FIFO buffer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGELAST</name>
                  <description>Single message object or last message object of a FIFO buffer</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXRQST</name>
              <description>Transmit request</description>
              <bitRange>[8:8]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>NOWAIT</name>
                  <description>This message object is not waiting for transmission</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT</name>
                  <description>The transmission of this message object is requested and is not yet done</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RMTEN</name>
              <description>Remote enable</description>
              <bitRange>[9:9]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>NOCHANGE</name>
                  <description>At the reception of a remote frame, TXRQST is left unchanged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>At the reception of a remote frame, TXRQST is set</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXIE</name>
              <description>Receive interrupt enable</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>NOCHANGE</name>
                  <description>INTPND will be left unchanged after successful reception of a frame</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>INTPND will be set after successful reception of a frame</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXIE</name>
              <description>Transmit interrupt enable</description>
              <bitRange>[11:11]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>NOCHANGE</name>
                  <description>The INTPND bit will be left unchanged after a successful transmission of a frame</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>INTPND will be set after a successful transmission of a frame</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UMASK</name>
              <description>Use acceptance mask If UMASK is set to 1, the message object's mask bits have to be programmed during initialization of the message object before MAGVAL is set to 1</description>
              <bitRange>[12:12]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>IGNORE</name>
                  <description>Mask ignored</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USEMASK</name>
                  <description>Use mask (MSK[28:0], MXTD, and MDIR) for acceptance filtering</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTPND</name>
              <description>Interrupt pending</description>
              <bitRange>[13:13]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>NOINTSOURCE</name>
                  <description>This message object is not the source of an interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTSOURCE</name>
                  <description>This message object is the source of an interrupt. The Interrupt Identifier in the Interrupt Register will point to this message object if there is no other interrupt source with higher priority</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSGLST</name>
              <description>Message lost (only valid for message objects in the direction receive)</description>
              <bitRange>[14:14]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>NOLOST</name>
                  <description>No message lost since this bit was reset last by the CPU</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEWMESSAGE</name>
                  <description>The Message Handler stored a new message into this object when NEWDAT was still set, the CPU has lost a message</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NEWDAT</name>
              <description>New data</description>
              <bitRange>[15:15]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>NONEWDATA</name>
                  <description>No new data has been written into the data portion of this message object by the message handler since this flag was cleared last by the CPU</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEWDATA</name>
                  <description>The message handler or the CPU has written new data into the data portion of this message object</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x60</dimIncrement>
          <dimIndex>1-2</dimIndex>
          <name>CANIF%s_DA1</name>
          <description>Message interface 1 data A1</description>
          <addressOffset>0x03C</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA0</name>
              <description>Data byte 0</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>DATA1</name>
              <description>Data byte 1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x60</dimIncrement>
          <dimIndex>1-2</dimIndex>
          <name>CANIF%s_DA2</name>
          <description>Message interface 1 data A2</description>
          <addressOffset>0x040</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA2</name>
              <description>Data byte 2</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>DATA3</name>
              <description>Data byte 3</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x60</dimIncrement>
          <dimIndex>1-2</dimIndex>
          <name>CANIF%s_DB1</name>
          <description>Message interface 1 data B1</description>
          <addressOffset>0x044</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA4</name>
              <description>Data byte 4</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>DATA5</name>
              <description>Data byte 5</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x60</dimIncrement>
          <dimIndex>1-2</dimIndex>
          <name>CANIF%s_DB2</name>
          <description>Message interface 1 data B2</description>
          <addressOffset>0x048</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA6</name>
              <description>Data byte 6</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>DATA7</name>
              <description>Data byte 7</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CANTXREQ1</name>
          <description>Transmission request 1</description>
          <addressOffset>0x100</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXRQST_16_1</name>
              <description>Transmission request bit of message objects 16 to 1. 0 = This message object is not waiting for transmission. 1 = The transmission of this message object is requested and not yet done</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CANTXREQ2</name>
          <description>Transmission request 2</description>
          <addressOffset>0x104</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXRQST_32_17</name>
              <description>Transmission request bit of message objects 32 to 17. 0 = This message object is not waiting for transmission. 1 = The transmission of this message object is requested and not yet done</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CANND1</name>
          <description>New data 1</description>
          <addressOffset>0x120</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NEWDAT_16_1</name>
              <description>New data bits of message objects 16 to 1. 0 = No new data has been written into the data portion of this Message Object by the Message Handler since last time this flag was cleared by the CPU. 1 = The Message Handler or the CPU has written new data into the data portion of this Message Object</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CANND2</name>
          <description>New data 2</description>
          <addressOffset>0x124</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NEWDAT_32_17</name>
              <description>New data bits of message objects 32 to 17. 0 = No new data has been written into the data portion of this Message Object by the Message Handler since last time this flag was cleared by the CPU. 1 = The Message Handler or the CPU has written new data into the data portion of this Message Object</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CANIR1</name>
          <description>Interrupt pending 1</description>
          <addressOffset>0x140</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INTPND_16_1</name>
              <description>Interrupt pending bits of message objects 16 to 1. 0 = This message object is ignored by the message handler. 1 = This message object is the source of an interrupt</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CANIR2</name>
          <description>Interrupt pending 2</description>
          <addressOffset>0x144</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INTPND_32_17</name>
              <description>Interrupt pending bits of message objects 32 to 17. 0 = This message object is ignored by the message handler. 1 = This message object is the source of an interrupt</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CANMSGV1</name>
          <description>Message valid 1</description>
          <addressOffset>0x160</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MSGVAL_16_1</name>
              <description>Message valid bits of message objects 16 to 1. 0 = This message object is ignored by the message handler. 1 = This message object is configured and should be considered by the message handler</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CANMSGV2</name>
          <description>Message valid 2</description>
          <addressOffset>0x164</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MSGVAL_32_17</name>
              <description>Message valid bits of message objects 32 to 17. 0 = This message object is ignored by the message handler. 1 = This message object is configured and should be considered by the message handler</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
