TomCrypto/lpc11xx/svd/LPC11xx-v6-z0.xml
        <register>
          <name>IS</name>
          <description>Interrupt sense register</description>
          <addressOffset>0x8004</addressOffset>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ISENSE0</name>
              <description>PIOn_0</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>EDGE</name>
                  <description>Pin interrupt is edge-sensitive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Pin interrupt is level-sensitive</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISENSE1</name>
              <description>PIOn_1</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>EDGE</name>
                  <description>Pin interrupt is edge-sensitive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Pin interrupt is level-sensitive</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISENSE2</name>
              <description>PIOn_2</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>EDGE</name>
                  <description>Pin interrupt is edge-sensitive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Pin interrupt is level-sensitive</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISENSE3</name>
              <description>PIOn_3</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>EDGE</name>
                  <description>Pin interrupt is edge-sensitive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Pin interrupt is level-sensitive</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISENSE4</name>
              <description>PIOn_4</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>EDGE</name>
                  <description>Pin interrupt is edge-sensitive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Pin interrupt is level-sensitive</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISENSE5</name>
              <description>PIOn_5</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>EDGE</name>
                  <description>Pin interrupt is edge-sensitive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Pin interrupt is level-sensitive</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISENSE6</name>
              <description>PIOn_6</description>
              <bitRange>[6:6]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>EDGE</name>
                  <description>Pin interrupt is edge-sensitive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Pin interrupt is level-sensitive</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISENSE7</name>
              <description>PIOn_7</description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>EDGE</name>
                  <description>Pin interrupt is edge-sensitive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Pin interrupt is level-sensitive</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISENSE8</name>
              <description>PIOn_8</description>
              <bitRange>[8:8]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>EDGE</name>
                  <description>Pin interrupt is edge-sensitive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Pin interrupt is level-sensitive</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISENSE9</name>
              <description>PIOn_9</description>
              <bitRange>[9:9]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>EDGE</name>
                  <description>Pin interrupt is edge-sensitive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Pin interrupt is level-sensitive</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISENSE10</name>
              <description>PIOn_10</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>EDGE</name>
                  <description>Pin interrupt is edge-sensitive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Pin interrupt is level-sensitive</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISENSE11</name>
              <description>PIOn_11</description>
              <bitRange>[11:11]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>EDGE</name>
                  <description>Pin interrupt is edge-sensitive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Pin interrupt is level-sensitive</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IBE</name>
          <description>Interrupt both-edges register</description>
          <addressOffset>0x8008</addressOffset>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IBE0</name>
              <description>PIOn_0</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>IEV</name>
                  <description>Pin interrupt edge is configured through the IEV register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Pin interrupt is triggered on both rising and falling edges (if edge-sensitive)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IBE1</name>
              <description>PIOn_1</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>IEV</name>
                  <description>Pin interrupt edge is configured through the IEV register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Pin interrupt is triggered on both rising and falling edges (if edge-sensitive)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IBE2</name>
              <description>PIOn_2</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>IEV</name>
                  <description>Pin interrupt edge is configured through the IEV register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Pin interrupt is triggered on both rising and falling edges (if edge-sensitive)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IBE3</name>
              <description>PIOn_3</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>IEV</name>
                  <description>Pin interrupt edge is configured through the IEV register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Pin interrupt is triggered on both rising and falling edges (if edge-sensitive)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IBE4</name>
              <description>PIOn_4</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>IEV</name>
                  <description>Pin interrupt edge is configured through the IEV register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Pin interrupt is triggered on both rising and falling edges (if edge-sensitive)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IBE5</name>
              <description>PIOn_5</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>IEV</name>
                  <description>Pin interrupt edge is configured through the IEV register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Pin interrupt is triggered on both rising and falling edges (if edge-sensitive)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IBE6</name>
              <description>PIOn_6</description>
              <bitRange>[6:6]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>IEV</name>
                  <description>Pin interrupt edge is configured through the IEV register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Pin interrupt is triggered on both rising and falling edges (if edge-sensitive)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IBE7</name>
              <description>PIOn_7</description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>IEV</name>
                  <description>Pin interrupt edge is configured through the IEV register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Pin interrupt is triggered on both rising and falling edges (if edge-sensitive)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IBE8</name>
              <description>PIOn_8</description>
              <bitRange>[8:8]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>IEV</name>
                  <description>Pin interrupt edge is configured through the IEV register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Pin interrupt is triggered on both rising and falling edges (if edge-sensitive)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IBE9</name>
              <description>PIOn_9</description>
              <bitRange>[9:9]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>IEV</name>
                  <description>Pin interrupt edge is configured through the IEV register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Pin interrupt is triggered on both rising and falling edges (if edge-sensitive)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IBE10</name>
              <description>PIOn_10</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>IEV</name>
                  <description>Pin interrupt edge is configured through the IEV register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Pin interrupt is triggered on both rising and falling edges (if edge-sensitive)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IBE11</name>
              <description>PIOn_11</description>
              <bitRange>[11:11]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>IEV</name>
                  <description>Pin interrupt edge is configured through the IEV register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Pin interrupt is triggered on both rising and falling edges (if edge-sensitive)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:12]</bitRange>
            </field>
          </fields>
        </register>
