TomCrypto/lpc11xx/svd/LPC11xx-v6-z0.xml
        <register>
          <name>IEV</name>
          <description>Interrupt event register</description>
          <addressOffset>0x800C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IEV0</name>
              <description>PIOn_0</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Pin interrupt is triggered on falling edges (if edge-sensitive)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Pin interrupt is triggered on rising edges (if edge-sensitive)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IEV1</name>
              <description>PIOn_1</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Pin interrupt is triggered on falling edges (if edge-sensitive)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Pin interrupt is triggered on rising edges (if edge-sensitive)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IEV2</name>
              <description>PIOn_2</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Pin interrupt is triggered on falling edges (if edge-sensitive)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Pin interrupt is triggered on rising edges (if edge-sensitive)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IEV3</name>
              <description>PIOn_3</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Pin interrupt is triggered on falling edges (if edge-sensitive)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Pin interrupt is triggered on rising edges (if edge-sensitive)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IEV4</name>
              <description>PIOn_4</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Pin interrupt is triggered on falling edges (if edge-sensitive)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Pin interrupt is triggered on rising edges (if edge-sensitive)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IEV5</name>
              <description>PIOn_5</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Pin interrupt is triggered on falling edges (if edge-sensitive)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Pin interrupt is triggered on rising edges (if edge-sensitive)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IEV6</name>
              <description>PIOn_6</description>
              <bitRange>[6:6]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Pin interrupt is triggered on falling edges (if edge-sensitive)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Pin interrupt is triggered on rising edges (if edge-sensitive)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IEV7</name>
              <description>PIOn_7</description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Pin interrupt is triggered on falling edges (if edge-sensitive)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Pin interrupt is triggered on rising edges (if edge-sensitive)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IEV8</name>
              <description>PIOn_8</description>
              <bitRange>[8:8]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Pin interrupt is triggered on falling edges (if edge-sensitive)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Pin interrupt is triggered on rising edges (if edge-sensitive)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IEV9</name>
              <description>PIOn_9</description>
              <bitRange>[9:9]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Pin interrupt is triggered on falling edges (if edge-sensitive)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Pin interrupt is triggered on rising edges (if edge-sensitive)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IEV10</name>
              <description>PIOn_10</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Pin interrupt is triggered on falling edges (if edge-sensitive)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Pin interrupt is triggered on rising edges (if edge-sensitive)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IEV11</name>
              <description>PIOn_11</description>
              <bitRange>[11:11]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Pin interrupt is triggered on falling edges (if edge-sensitive)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Pin interrupt is triggered on rising edges (if edge-sensitive)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IE</name>
          <description>Interrupt mask register</description>
          <addressOffset>0x8010</addressOffset>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MASK0</name>
              <description>PIOn_0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>MASK1</name>
              <description>PIOn_1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>MASK2</name>
              <description>PIOn_2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>MASK3</name>
              <description>PIOn_3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>MASK4</name>
              <description>PIOn_4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>MASK5</name>
              <description>PIOn_5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>MASK6</name>
              <description>PIOn_6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>MASK7</name>
              <description>PIOn_7</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>MASK8</name>
              <description>PIOn_8</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>MASK9</name>
              <description>PIOn_9</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>MASK10</name>
              <description>PIOn_10</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>MASK11</name>
              <description>PIOn_11</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <description>Raw interrupt status register</description>
          <addressOffset>0x8014</addressOffset>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RAWST0</name>
              <description>PIOn_0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RAWST1</name>
              <description>PIOn_1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RAWST2</name>
              <description>PIOn_2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RAWST3</name>
              <description>PIOn_3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RAWST4</name>
              <description>PIOn_4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RAWST5</name>
              <description>PIOn_5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RAWST6</name>
              <description>PIOn_6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RAWST7</name>
              <description>PIOn_7</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RAWST8</name>
              <description>PIOn_8</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RAWST9</name>
              <description>PIOn_9</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RAWST10</name>
              <description>PIOn_10</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RAWST11</name>
              <description>PIOn_11</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <description>Masked interrupt status register</description>
          <addressOffset>0x8018</addressOffset>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MASK0</name>
              <description>PIOn_0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>MASK1</name>
              <description>PIOn_1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>MASK2</name>
              <description>PIOn_2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>MASK3</name>
              <description>PIOn_3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>MASK4</name>
              <description>PIOn_4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>MASK5</name>
              <description>PIOn_5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>MASK6</name>
              <description>PIOn_6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>MASK7</name>
              <description>PIOn_7</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>MASK8</name>
              <description>PIOn_8</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>MASK9</name>
              <description>PIOn_9</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>MASK10</name>
              <description>PIOn_10</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>MASK11</name>
              <description>PIOn_11</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IC</name>
          <description>Interrupt clear register</description>
          <addressOffset>0x801C</addressOffset>
          <access>write-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLR0</name>
              <description>PIOn_0</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>CLEAR_INTERRUPT</name>
                  <description>Clear pin interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLR1</name>
              <description>PIOn_1</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>CLEAR_INTERRUPT</name>
                  <description>Clear pin interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLR2</name>
              <description>PIOn_2</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>CLEAR_INTERRUPT</name>
                  <description>Clear pin interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLR3</name>
              <description>PIOn_3</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>CLEAR_INTERRUPT</name>
                  <description>Clear pin interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLR4</name>
              <description>PIOn_4</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>CLEAR_INTERRUPT</name>
                  <description>Clear pin interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLR5</name>
              <description>PIOn_5</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>CLEAR_INTERRUPT</name>
                  <description>Clear pin interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLR6</name>
              <description>PIOn_6</description>
              <bitRange>[6:6]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>CLEAR_INTERRUPT</name>
                  <description>Clear pin interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLR7</name>
              <description>PIOn_7</description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>CLEAR_INTERRUPT</name>
                  <description>Clear pin interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLR8</name>
              <description>PIOn_8</description>
              <bitRange>[8:8]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>CLEAR_INTERRUPT</name>
                  <description>Clear pin interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLR9</name>
              <description>PIOn_9</description>
              <bitRange>[9:9]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>CLEAR_INTERRUPT</name>
                  <description>Clear pin interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLR10</name>
              <description>PIOn_10</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>CLEAR_INTERRUPT</name>
                  <description>Clear pin interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLR11</name>
              <description>PIOn_11</description>
              <bitRange>[11:11]</bitRange>
              <enumeratedValues>
                <name>ENUM</name>
                <enumeratedValue>
                  <name>CLEAR_INTERRUPT</name>
                  <description>Clear pin interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved</description>
              <bitRange>[31:12]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="GPIO0">
      <name>GPIO1</name>
      <baseAddress>0x50010000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xFFFFFF</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO1</name>
        <value>30</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIO0">
      <name>GPIO2</name>
      <baseAddress>0x50020000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xFFFFFF</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO2</name>
        <value>29</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIO0">
      <name>GPIO3</name>
      <baseAddress>0x50030000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xFFFFFF</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO3</name>
        <value>28</value>
      </interrupt>
    </peripheral>
  </peripherals>
</device>
